han-kaka/UEL020100/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/code/app/app_comm_NB86.c
#include "app_comm_NB86.h"
#include "nrf_drv_gpiote.h"
//#include "nrf_delay.h"

static uint16_t NB_msCount = 0;

uint8_t                                 g_Rx_Buffer[BUFFSIZE] = {0};
uint8_t                                 g_Tx_Buffer[BUFFSIZE] = {0};

NB_Handler        g_stNB_Handler;
PACKET_HEAD_Type  PacketHead;

typedef void(*NB_State_Fun)(uint8_t *RxBuf); /* ¶¨Òå×´Ì¬´¦Àíº¯Êý*/
//typedef void(*GPRS_State_Fun)(void);
//static void APP_NB_RefreshRetryMess(void);
static uint8_t APP_NB_EvtTraverse(uint8_t mode);


static void APP_NB_State_Init_Proc(uint8_t *RxBuf);
static void APP_NB_State_Connect_Proc(uint8_t *RxBuf);
static void APP_NB_State_Mess_Proc(uint8_t *RxBuf);
static void APP_NB_State_Comm_Proc(uint8_t *RxBuf);

static const NB_State_Fun APP_NB_StateProcTbl[] = 
{
    NULL,     //POWER_ON
    NULL,     //RESET
    APP_NB_State_Init_Proc,
		APP_NB_State_Connect_Proc,
		APP_NB_State_Mess_Proc,
		APP_NB_State_Comm_Proc,
		NULL,
    NULL,
    NULL,
    NULL,
};


/******************GPRSÖ¸Áî¼¯**********************************/
const NB_Cmd_Data_Type AT_CmdTbl[] = 
{
    /*------cmdstr-----------------------------------revtimeout(s)--cmdtruebackstr----------retry_times */
    /************************* GPRS  network ***************************/
      {"AT+CFUN=0\r\n",                                  3,       "OK",                     3},
			{"AT+CFUN=1\r\n",                                  3,       "OK",                     3},
      {"AT+CFUN?\r\n",                                   3,       "CFUN:0",                 3},
			{"AT+CFUN?\r\n",                                   3,       "CFUN:1",                 3},
			{"AT+NCDP=180.101.147.115,5683\r\n",               3,       "OK",                     3},
			{"AT+NRB\r\n",                                     3,       "REBOOTING",              3},
			
			{"AT+CGSN=1\r\n",                                  3,       "CGSN",                   3},
			{"AT+NCSEARFCN\r\n",                               3,       "OK",                     3},
			{"AT+NCONFIG=CELL_RESELECTION,TRUE\r\n",           3,       "OK",                     3},
			{"AT+NCONFIG=CELL_RESELECTION,FALSE\r\n",          3,       "OK",                     3},
			{"AT+CMEE=1\r\n",                                  3,       "OK",                     3},
			{"AT+NCCID\r\n",                                   3,       "CCID:",                  3},
			
			{"AT+CGDCONT=1,\"IP\",\"ctnet\"\r\n",              3,       "OK",                     3},
			{"AT+CGATT=1\r\n",                                 3,       "OK",                     3},
			{"AT+CGATT=0\r\n",                                 3,       "OK",                     3},
			{"AT+CGATT?\r\n",                                  5,       "CGATT:1",               20},	
			{"AT+CGATT?\r\n",                                  5,       "CGATT:0",               20},	
			{"AT+CPSMS=1,,,01000011,01000011\r\n",             3,       "OK",                     3},
			{"AT+CEDRXS=0,5,0101\r\n",                         3,       "OK",                     3},
			{"AT+NPSMR=1\r\n",                                 3,       "OK",                     3},
			{"AT+CGPADDR\r\n",                                 5,       "OK",                    20},	
      
			{"AT+CSQ\r\n",   			                             3,	      "+CSQ",         	        3},
      {"AT+NMGS=37,00\r\n",   			                     3,	      "OK",         	          3},
      {"AT+NQMGS\r\n",   			                           3,	      "OK",         	          3},
			
      {"AT+NMGR\r\n",   			                           3,	      "OK",         	          3},			
			{"AT+NQMGR\r\n",   			                           3,	      "OK",         	          3},	

			{"AT+NPSMR?\r\n",   			                         3,	      "NPSMR:1,1",         	    3},				
			
};

/*************************³õÊ¼»¯Á÷³Ì***************************/
static const uint8_t s_ATCmdStep_Init[] = 
{
    NULL,
    NB_AT_CFUN_0,      
		NB_AT_CFUN0,      
		NB_AT_NCDP, 
		NB_AT_NRB,	
};

/************************* TCP/IPÊý¾ÝÁ´Â·½¨Á¢Á¬½Ó***************************/
static const uint8_t s_ATCmdStep_Connnect[] = 
{
		NB_AT_CGDCONT,
		NB_AT_CSQ,
		NB_AT_CGATT_1,
		NB_AT_CGATT1,	
	  NB_AT_CFUN_0, 
		NB_AT_CFUN0,  
		NB_AT_CPSMS_1,
		NB_AT_CEDRXS_0,
		NB_AT_NPSMR_1,
	  NB_AT_CFUN_1, 
		NB_AT_CFUN1,  
		NB_AT_CGATT_1,
		NB_AT_CGATT1,
		NB_AT_CGPADDR,
};

/*************************Êý¾Ý·¢ËÍÁ÷³Ì***************************/
static const uint8_t s_ATCmdStep_Comm[] = 
{
		NB_AT_CSQ,
    NB_AT_NMGS,
		NB_AT_NQMGS,   	
};

static const uint8_t s_ATCmdStep_Mess[] = 
{
    NULL,
	  NB_AT_CFUN_0, 
		NB_AT_CFUN0,  
		NB_AT_CGSN_1,
		NB_AT_NCSEARFCN,
		NB_AT_NCONFIG_TRUE,
		NB_AT_CMEE_1,	
		NB_AT_CFUN_1,
		NB_AT_CFUN1,
		NB_AT_NCCID,
};

static const uint8_t s_ATCmdStep_Read[] = 
{
		NB_AT_NMGR,
		NB_AT_NQMGR,
};

static const uint8_t s_ATCmdStep_Inquire[] = 
{
		NB_AT_NPSMR1,
};

/*Ð£ÑéATÖ¸ÁîÓ¦´ð½á¹ûÊÇ·ñÕýÈ·*/
static uint8_t APP_GPRS_ATCmdAckCheck(uint8_t *RxBuf)
{   

//    //ÅÐ¶ÏÊÇ·ñÊÇ·þÎñÆ÷ÏÂÐÐÊý¾Ý
//    if(Check_Strstr((char*)RxBuf, (char*)(char*)AT_CmdTbl[NB_AT_MIPRTCP].ExpResultStr, NB_ATCmdCB.ucRxLen) == true)
//    {
//        NB_ATCmdCB.RspType = RSP_TYPE_DATA;  //Í¨ÐÅÊý¾Ý
//        return BACK_TRUE;   //½ÓÊÕµ½ÕýÈ·Ó¦´ð
//    }
    if(Check_Strstr((char*)RxBuf, "Lierda", NB_ATCmdCB.ucRxLen) == true) //GPRSÄ£¿é×¼±¸¾ÍÐ÷ÍÆËÍ
    {
        Task_Flag_Struct.atReday_F = ENABLE;
        NB_ATCmdCB.RspType = RSP_TYPE_CMD;
		#if SEGGER_RTT_DEBUG_CMDPROC
				SEGGER_RTT_printf(0, "gprs model ready\r\n");
		#endif
				return BACK_TRUE;
    }
		#if SEGGER_RTT_DEBUG_CMDPROC
//			SEGGER_RTT_printf(0, (char*)RxBuf);
//			SEGGER_RTT_printf(0, NB_ATCmdCB.ExpResultStr);
//			SEGGER_RTT_printf(0, "\r\n");
		#endif
//    if(NB_ATCmdCB.ATCmdPt != NB_AT_MIPOPEN_1)//socketÁ¬½ÓÊ±,Ò²ÓÐ¿ÉÄÜ»Ø¸´MIPSTAT: 1,1
//    {
//        if(Check_Strstr((char*)RxBuf, "MIPSTAT: 1,1", NB_ATCmdCB.ucRxLen) == true)
//        {
//            NB_NetPar.NetConnSta = CONN_OFF;
//            g_stNB_Handler.State = NB_STATE_CONNECT_NET;    //ÖØÐÂÁ¬½Ósocket
//						g_stNB_Handler.StepPt = 2;
//						g_stNB_Handler.AuthStatus = NOT_AUTH;
//						NB_Event_Set(NB_EvtProc.ucUploadEvt, COMM_Event_AUTH);
//        }
//    }
//    if(NB_ATCmdCB.ATCmdPt != NB_AT_MIPCALL1) //ÓÉÓÚIP»ñÈ¡´íÎó£¬Ò²»áÈ¥²éÑ¯ÓÐÎÞIP
//    {
//        if(Check_Strstr((char*)RxBuf, "MIPCALL: 0", NB_ATCmdCB.ucRxLen) == true)
//        
//        { 
//            NB_NetPar.NetConnSta = CONN_OFF;
//						g_stNB_Handler.State = NB_STATE_CONNECT_NET;    //ÖØÐÂÁ¬½ÓÍøÂç
//						g_stNB_Handler.StepPt = 0;
//						g_stNB_Handler.AuthStatus = NOT_AUTH;
//						NB_Event_Set(NB_EvtProc.ucUploadEvt, COMM_Event_AUTH);
//        }
//    }
    
     //ÅÐ¶Ï½ÓÊÕµÄÊý¾ÝÊÇ·ñº¬ÓÐÆÚÍûÓ¦´ð
		if(Check_Strstr((char*)RxBuf, NB_ATCmdCB.ExpResultStr, NB_ATCmdCB.ucRxLen) == true)
		{
				if((NB_ATCmdCB.ATCmdPt == NB_AT_CFUN0) ||
					 (NB_ATCmdCB.ATCmdPt == NB_AT_CFUN1) ||
					 (NB_ATCmdCB.ATCmdPt == NB_AT_CGATT1) ||
					 (NB_ATCmdCB.ATCmdPt == NB_AT_CGATT0))
				{
						if(Check_Strstr((char*)RxBuf, "OK", 20) != true)
						{
								#if SEGGER_RTT_DEBUG_CFUN || SEGGER_RTT_DEBUG_CGATT
										SEGGER_RTT_printf(0, "at+cfun?/at+cgatt? error !\r\n");
										SEGGER_RTT_printf(0, (char*)RxBuf);
								#endif	
								return BACK_ERROR;  
						}
						#if SEGGER_RTT_DEBUG_CFUN || SEGGER_RTT_DEBUG_CGATT
								SEGGER_RTT_printf(0, "at+cfun?/at+cgatt? ok !\r\n");
						#endif
				}
				
				if((NB_ATCmdCB.ATCmdPt == NB_AT_CGSN_1) ||
					(NB_ATCmdCB.ATCmdPt == NB_AT_NCCID))
				{
						if(Check_Strstr((char*)RxBuf, "OK", 65) != true)
						{
								#if SEGGER_RTT_DEBUG_CGSN || SEGGER_RTT_DEBUG_NCCID
										SEGGER_RTT_printf(0, "at+cgsn=1/at+nccid error !\r\n");
										SEGGER_RTT_printf(0, (char*)RxBuf);
								#endif	
								return BACK_ERROR;  
						}
						#if SEGGER_RTT_DEBUG_CGSN || SEGGER_RTT_DEBUG_NCCID
								SEGGER_RTT_printf(0, "at+cgsn=1/at+nccid ok !\r\n");
						#endif
				}
				NB_ATCmdCB.RspType = RSP_TYPE_CMD;//Ó¦´ðATÖ¸Áî
				return BACK_TRUE;                 //½ÓÊÕµ½ÕýÈ·Ó¦´ð
		} 
    else
		{   
//				//ÓÉÓÚ»ñÈ¡ÍøÂç²àµØÖ·ºÍ½¨Á¢soctetÁ¬½Ó¶¼ÊÇ·ÖÁ½Ìõ·µ»ØµÄ£¬µÚÒ»Ìõ¶¼Îª"OK"
//				if((NB_ATCmdCB.ATCmdPt == NB_AT_MIPCALL_1) || NB_ATCmdCB.ATCmdPt == NB_AT_MIPOPEN_1)
//				{
//						if(Check_Strstr((char*)RxBuf, "OK", 4) == true)   //È¥µôÕâÒ»¾äÔÙÊÔ
//						{
//								return NO_BACK;   /*µÚÒ»Ìõ"OK"·µ»ØÕýÈ·£¬ËùÒÔ¼ÌÐøµÈ´ý*/
//						}
//				}
			  //²éÑ¯ÊÇ·ñ×¤Íø³É¹¦£¬Èç²»³É¹¦£¬ÄÇÃ´µÈ´ý3S£¬¶ø²»ÊÇ·µ»Ø´íÎó£¬¸ÃÌõÖ¸ÁîÌØÊâ
				if(NB_ATCmdCB.ATCmdPt == NB_AT_CGATT1) 
				{
						return NO_BACK;
				}
			return BACK_ERROR;   		
		}	
}

//static U8 APP_GPRS_Encrypt(u8 *hex_data_buf,u8 len_hex,u8 *new_hex_data_buf,u8 *new_len_hex)
//{
//  u8 len=0;
//  for(u8 i=0;i<len_hex;i++,len++)
//  {
//    switch(hex_data_buf[i])
//    {
//      case TRANSFER_CHAR1:
//              new_hex_data_buf[len]=TRANSFER_FLAG;
//              len++;
//              new_hex_data_buf[len]=TRANSFER_CHAR1_FLAG;
//              break;
//      case TRANSFER_CHAR2:
//              new_hex_data_buf[len]=TRANSFER_FLAG;
//              len++;
//              new_hex_data_buf[len]=TRANSFER_CHAR2_FLAG;
//              break;
//      default:
//              new_hex_data_buf[len]=hex_data_buf[i];
//              break;
//     }
//  }
//  *new_len_hex=len;
//  if(*new_len_hex<=GPRS_RX_BUFF_LEN){
//    return TRUE;
//  }
//  else{
//    return FALSE;
//  }
//}

//static void APP_GPRS_Data_Trope(u8 *hex_data_buf,u8 len_hex,u8 *new_hex_data_buf)
//{
//  u16 len_hex_cnt=0;
//  u16 len_temp=0;
//				
//  for(len_temp=0;len_hex_cnt<len_hex;len_hex_cnt++,len_temp++)      
//  {
//    if(hex_data_buf[len_hex_cnt]==TRANSFER_FLAG)
//    {
//      switch(hex_data_buf[len_hex_cnt+1])
//      {
//        case TRANSFER_CHAR1_FLAG:
//              new_hex_data_buf[len_temp]=TRANSFER_CHAR1;
//              len_hex_cnt++;
//              break;
//        case TRANSFER_CHAR2_FLAG:
//              new_hex_data_buf[len_temp]=TRANSFER_CHAR2;
//              len_hex_cnt++;
//              break;
//        default:
//        #if DEBUG_LOG
//              BSP_LOG("0x1b error\r\n");
//        #endif
//              break;
//      }
//    }
//    else
//    {
//       new_hex_data_buf[len_temp]=hex_data_buf[len_hex_cnt];
//    }
//  } 
//}
//static void APP_GPRS_GetSysStaMessPacket(U8 status,U8 *num,U8* Packet)
//{
//    U8 i=0;
//    U16 VoltValue=0;
//    i=*num;
//    if(status != CHARGE_DISABLE)
//    {
//           GPRS_SysStaMess.chargeTime = g_stCharge_Handler.ChargeTimCnt;    //³äµçÊ±³¤
//           VoltValue = USB_Voltage_Value();
//           GPRS_SysStaMess.chargeVolt = Data16_2_BCD(VoltValue);
//           GPRS_SysStaMess.chargeElec = Data16_2_BCD(VoltValue*10);  
//    }
//    else
//    {
//           GPRS_SysStaMess.chargeTime = 0;
//           GPRS_SysStaMess.chargeVolt = 0;
//           GPRS_SysStaMess.chargeElec = 0;
//    }
//    GPRS_SysStaMess.refVolt   = Data16_2_BCD((u16)ADC_Vref_Calculate());
//    Packet[i++] = (GPRS_CommPacket.MessRead.DeviceState.state>>8) & 0xff;
//    Packet[i++] = (GPRS_CommPacket.MessRead.DeviceState.state) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.chargeTime>>8) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.chargeTime) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.chargeElec>>8) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.chargeElec) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.chargeVolt>>8) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.chargeVolt) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.refVolt>>8) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.refVolt) & 0xff;
//    *num = i;
//}

static uint16_t APP_NB_GetPacket(uint16_t messID, uint8_t ctrolcode, uint8_t datalen, uint8_t* Packet)
{
//    U8 i=0,j=0;
//    U8 check=0;
//    U8 ipLen=0;
//    U8 apnLen=0;
//    U8 fillZeroLen=0;
//    U8 newLen=0;
//    U8 TxBuf[GPRS_RX_BUFF_LEN]={0};
//#if DEBUG_RTY_FUN
//    static U8 rtyTestCnt=0;
//#endif
//   
//    TxBuf[i++] = FRAME_HEAD;
//    TxBuf[i++] = 0x02;    //²úÆ·ÀàÐÍ
//    for(j=0;j<ADDR_REGION_LEN;j++)
//    {
//       TxBuf[i++] = PacketHead.addrRegion[j]&0xff;
//    }
//    TxBuf[i++] = ctrolcode&0xff;
//    TxBuf[i++] = datalen&0xff;
//    TxBuf[i++] = (messID>>8)&0xff;
//    TxBuf[i++] = messID&0xff;
    switch(messID)
    {
//       case AUTHENTICA_ID:
//       {
//           TxBuf[i++] = PacketHead.TerminalMeageFlowNum;
//           for(j=0;j<6;j++)
//           {
//               TxBuf[i++] = GPRS_CommPacket.AuthData.iccid[j+4];
//           }
//       }
//       break;
//       
//       case STA_MESS_ID:
//       {
//           TxBuf[i++] = PacketHead.TerminalMeageFlowNum;
//           GPRS_CommPacket.MessRead.DeviceState.staOfCharge = Charge_Flag.ChargeStatus;
//           GPRS_CommPacket.MessRead.DeviceState.PhoneOnLineSta = Charge_Flag.PhoneOnLineStatus;
//           APP_GPRS_GetSysStaMessPacket(GPRS_CommPacket.MessRead.DeviceState.staOfCharge,&i,TxBuf);
//       }
//       
//       break;
//       case HEARTBEAT_ID:
//       {
//           TxBuf[i++] = PacketHead.TerminalMeageFlowNum;
//           //ÐÄÌø°üÊý¾ÝÎª¿Õ
//       }
//       
//       break;

//       case SET_PARMTE_ID:
//       {
//           TxBuf[i++] = PacketHead.AckMeageFlowNum;
//           //·µ»ØÊý¾ÝÄÚÈÝÎª¿Õ
//       }
//       break;
//       case QUERY_PARMTE_ID:
//       {
//            TxBuf[i++] = PacketHead.AckMeageFlowNum;
//            ipLen  = strlen((char *)GPRS_NetPar.ServerIp);
//            apnLen = strlen((char *)GPRS_NetPar.ServerApn);
//            for(j=0;j<ipLen;j++)
//            {
//                TxBuf[i++] = (GPRS_NetPar.ServerIp[j]) & 0xff;
//            }
//            fillZeroLen = SERVER_IP_LEN-ipLen;
//            for(j=0;j<fillZeroLen;j++)        //ÎªÁËÌîÂúSERVER_IP_LEN(17)³¤¶ÈµÄ×Ö½Ú
//            {
//                TxBuf[i++] = 0;
//            }  
//            
//            TxBuf[i++] = (GPRS_NetPar.ServerPort>>8) & 0xff;
//            TxBuf[i++] = (GPRS_NetPar.ServerPort) & 0xff;
//            for(j=0;j<apnLen;j++)
//            {
//                TxBuf[i++] = GPRS_NetPar.ServerApn[j] & 0xff;
//            }
//            fillZeroLen = SERVER_APN_LEN - apnLen;
//            for(j=0;j<fillZeroLen;j++)
//            {
//                TxBuf[i++] = 0;
//            } 
//       }
//       break;
//       case READ_MESS_ID:
//       {
//            GPRS_CommPacket.MessRead.DeviceState.staOfCharge = Charge_Flag.ChargeStatus;
//            GPRS_CommPacket.MessRead.DeviceState.PhoneOnLineSta = Charge_Flag.PhoneOnLineStatus;
//            TxBuf[i++] = PacketHead.AckMeageFlowNum;
//            TxBuf[i++] = (GPRS_CommPacket.MessRead.DeviceState.state>>8) & 0xff;
//            TxBuf[i++] = (GPRS_CommPacket.MessRead.DeviceState.state) & 0xff;
//            TxBuf[i++] = (GPRS_CommPacket.MessRead.CSQ) & 0xff;
//            TxBuf[i++] = (GPRS_CommPacket.MessRead.hardwareVerLen) & 0xff;
//            for(j=0;j<GPRS_CommPacket.MessRead.hardwareVerLen;j++)
//            {
//                TxBuf[i++] = (GPRS_CommPacket.MessRead.hardwareVer[j]) & 0xff;
//            }
//            TxBuf[i++] = (GPRS_CommPacket.MessRead.softwareVerLen) & 0xff;
//            for(j=0;j<GPRS_CommPacket.MessRead.softwareVerLen;j++)
//            {
//                TxBuf[i++] = (GPRS_CommPacket.MessRead.softwareVer[j]) & 0xff;
//            }
//       }
//       break;
//       case CONTROL_ID:
//       {
//           TxBuf[i++] = PacketHead.AckMeageFlowNum;
//            //·µ»ØÊý¾ÝÄÚÈÝÎª¿Õ
//       }
//       break;
//       case WRITE_ADDR_ID:
//       {
//          TxBuf[i++] = PacketHead.AckMeageFlowNum;
//           //·µ»ØÊý¾ÝÄÚÈÝÎª¿Õ
//       }
//       break;
//       case READ_ADDR_ID:
//       {
//          TxBuf[i++] = PacketHead.AckMeageFlowNum;
//          for(j=0;j<4;j++)
//          {
//               TxBuf[i++] = (PacketHead.addrRegion[j]) & 0xff;
//          }
//       }
//       break;
//       case READ_STA_MESS_ID:
//       {
//          TxBuf[i++] = PacketHead.AckMeageFlowNum;
//          GPRS_CommPacket.MessRead.DeviceState.staOfCharge = Charge_Flag.ChargeStatus;
//          GPRS_CommPacket.MessRead.DeviceState.PhoneOnLineSta = Charge_Flag.PhoneOnLineStatus;
//          APP_GPRS_GetSysStaMessPacket(GPRS_CommPacket.MessRead.DeviceState.staOfCharge,&i,TxBuf);
//       }
//       break;
//       case SYS_PARMTE_SET_ID:
//       {
//          TxBuf[i++] = PacketHead.AckMeageFlowNum;
//           //·µ»ØÊý¾ÝÄÚÈÝÎª¿Õ
//       }
//       break;
    }
//    check = Get_Xor(TxBuf,i); //¼ÆËãÐ£ÑéºÍ
//    TxBuf[i++] = check&0xff;
//#if DEBUG_RTY_FUN
//    rtyTestCnt++;
//    if(rtyTestCnt <=2)
//    {
//        for(j=0;j<3;j++)
//        {
//            TxBuf[i++]=j;
//        }
//    } 
//    if((rtyTestCnt <=8) && (rtyTestCnt >=4))
//    {
//         for(j=0;j<3;j++)
//         {
//              TxBuf[i++]=j;
//         }
//    }
//#endif     
//    TxBuf[i++] = FRAME_END;
//    APP_GPRS_Encrypt(TxBuf,i,Packet,&newLen);
//    return   (U16)newLen;
}

static void APP_NB_RetryMessInit(void)
{
   NB_RetryCtrol.rtycnt = 0;
   NB_RetryCtrol.rtycntEn = DISABLE;
   
   NB_RetryCtrol.rtyTimCount =0;
   NB_RetryCtrol.rtyTime = RTY_TIME_INIT;
#if CONFIG_RETRY_COPY
   GPRS_RetryCtrol.rtyLen = 0;
   memset(GPRS_RetryCtrol.rtyBuff,0,GPRS_RTY_MESS_LEN);
#endif
}

//static void APP_GPRS_RefreshRetryMess(void)
//{
//   GPRS_RetryCtrol.rtycnt++;
//   GPRS_RetryCtrol.rtycntEn = ENABLE;
//   GPRS_RetryCtrol.rtyTimCount =0;
//   GPRS_RetryCtrol.rtyTime = RTY_TIME_INIT;   
//}

#if CONFIG_RETRY_COPY
static uint16_t APP_NB_WriteRetryIDPacket(uint8_t* Packet)
{
//ÖØ´«Ê±Ò²ÖØÐÂ×é°ü£¬·ÀÖ¹µÚÒ»°üÊý¾Ý³ö´í£¬ÄÇÃ´ºóÐøÁ½°üÊý¾ÝÒ²»á´íÎó
//ºóÐøÖØ´«Éæ¼°µ½Ê±¼äÊý¾Ý£¬ÄÇÃ´Ðè°ÑÊý¾Ý±£´æ£¬ÖØÐÂ×é°üÊ±ÔÙ·ÅÈë
//ÈçÖØ´«Ê±²»ÖØÐÂ×é°ü£¬Ðè°ÑºêCONFIG_RETRY_COPYÖÃÎ»
    uint16_t usPacketLen=0;
#if SEGGER_RTT_DEBUG_NB86
		BSP_LOG("retry send mess\r\n");
#endif
    memcpy(Packet,GPRS_RetryCtrol.rtyBuff,GPRS_RetryCtrol.rtyLen);    //ÖØ´«ÐÅÏ¢copyÖÁ·¢ËÍ»º´æ
    usPacketLen = GPRS_RetryCtrol.rtyLen;                             
    return usPacketLen;    
}

#endif

uint16_t APP_NB_WriteReturnIDPacket(uint8_t DataID, uint8_t* Packet)
{
    uint16_t usPacketLen=0;
	
		switch(DataID)
		{
//				case RETURN_ID_SET_PARMTE:
//				{
//					usPacketLen = APP_GPRS_GetPacket(SET_PARMTE_ID,SET_PARMTE_CTROL_CODE,SET_PARMTE_LEN,Packet); 
//						#if SEGGER_RTT_DEBUG_NB86
//								BSP_LOG("send set parte mess\r\n");
//						#endif
//				}break;	
//				case RETURN_ID_QUERY_PARMTE:
//				{
//					usPacketLen = APP_GPRS_GetPacket(QUERY_PARMTE_ID,QUERY_PARMTE_CTROL_CODE,QUERY_PARMTE_LEN,Packet); 
//						#if SEGGER_RTT_DEBUG_NB86
//								BSP_LOG("send query parte mess\r\n");
//						#endif
//				}break;
//				case RETURN_ID_READ_MESS:
//				{
//					usPacketLen = APP_GPRS_GetPacket(READ_MESS_ID,READ_MESS_CTROL_CODE,READ_MESS_LEN,Packet); 
//						#if SEGGER_RTT_DEBUG_NB86
//								BSP_LOG("send read mess\r\n");
//						#endif
//				}break;
//				case RETURN_ID_CTROL:
//				{
//					usPacketLen = APP_GPRS_GetPacket(CONTROL_ID,CTROL_CODE,CTROL_LEN,Packet); 
//						#if SEGGER_RTT_DEBUG_NB86
//								BSP_LOG("send ctrol mess\r\n");
//						#endif
//				}break;
//				case RETURN_ID_WRITE_ADDR:
//				{
//					usPacketLen = APP_GPRS_GetPacket(WRITE_ADDR_ID,WRITE_ADDR_CTROL_CODE,WRITE_ADDR_LEN,Packet); 
//						#if SEGGER_RTT_DEBUG_NB86
//								BSP_LOG("send write addr mess\r\n");
//						#endif
//				}break;
//				case RETURN_ID_READ_ADDR:
//				{
//					usPacketLen = APP_GPRS_GetPacket(READ_ADDR_ID,READ_ADDR_CTROL_CODE,READ_ADDR_LEN,Packet); 
//						#if SEGGER_RTT_DEBUG_NB86
//								BSP_LOG("send read addr mess\r\n");
//						#endif
//				}break;
//				case RETURN_ID_READ_STA_MESS:
//				{
//					usPacketLen = APP_GPRS_GetPacket(READ_STA_MESS_ID,READ_STA_MESS_CTROL_CODE,READ_STA_MESS_LEN,Packet); 
//						#if SEGGER_RTT_DEBUG_NB86
//								BSP_LOG("send read status mess\r\n");
//						#endif
//				}break;
//				case RETURN_ID_SYS_PARMTE_SET:
//				{
//					usPacketLen = APP_GPRS_GetPacket(SYS_PARMTE_SET_ID,SYS_PARMTE_SET_CTROL_CODE,SYS_PARMTE_SET_LEN,Packet); 
//						#if SEGGER_RTT_DEBUG_NB86
//								BSP_LOG("send sys parmte set\r\n");
//						#endif
//				}break;
				default:
						break;
		}
		return usPacketLen;
}

