han-kaka/UEL020100/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/code/app/app_comm_NB86.c
/*¸ù¾Ý²»Í¬µÄÊý¾ÝID,½øÐÐ×éÖ¡£¬·â×°Ð­Òé²ãµÄÖ¡ÄÚÈÝ*/
static uint16_t APP_NB_WriteDataIDPacket(uint8_t DataID, uint8_t* Packet)
{
    uint16_t usPacketLen = 0;
		switch(DataID)
		{   
				case UPLOAD_ID_INIT:
				{
//						usPacketLen = APP_NB_GetPacket(AUTHENTICA_ID, AUTH_CTROL_CODE, AUTH_LEN, Packet);
//				#if CONFIG_RETRY_COPY            
//						GPRS_RetryCtrol.rtyLen = usPacketLen;                   //ÏûÏ¢³¤¶È±¸·Ý
//						memcpy(GPRS_RetryCtrol.rtyBuff,Packet,usPacketLen);     //ÏûÏ¢±¸·Ý   
//				#endif
				#if SEGGER_RTT_DEBUG_MESS
						SEGGER_RTT_printf(0, "init mess upload\r\n");
				#endif
				}
						break;
		
				case UPLOAD_ID_LOG:
				{
//						usPacketLen = APP_NB_GetPacket(AUTHENTICA_ID, AUTH_CTROL_CODE, AUTH_LEN, Packet);
//				#if CONFIG_RETRY_COPY            
//						GPRS_RetryCtrol.rtyLen = usPacketLen;                   //ÏûÏ¢³¤¶È±¸·Ý
//						memcpy(GPRS_RetryCtrol.rtyBuff,Packet,usPacketLen);     //ÏûÏ¢±¸·Ý   
//				#endif
				#if SEGGER_RTT_DEBUG_MESS
						SEGGER_RTT_printf(0, "log mess upload\r\n");
				#endif
				}
						break;
				
//				case UPLOAD_ID_AUTH:
//				{
//						usPacketLen = APP_GPRS_GetPacket(AUTHENTICA_ID,AUTH_CTROL_CODE,AUTH_LEN,Packet);
//				#if CONFIG_RETRY_COPY            
//						GPRS_RetryCtrol.rtyLen = usPacketLen;                   //ÏûÏ¢³¤¶È±¸·Ý
//						memcpy(GPRS_RetryCtrol.rtyBuff,Packet,usPacketLen);     //ÏûÏ¢±¸·Ý   
//				#endif
//				#if DEBUG_LOG
//						BSP_LOG("auth mess upload\r\n");
//				#endif
//				}
//						break;
//				
//				case UPLOAD_ID_STA_MESS:
//				{
//						usPacketLen = APP_GPRS_GetPacket(STA_MESS_ID,STA_MESS_CTROL_CODE,STA_MESS_LEN,Packet);
//				#if CONFIG_RETRY_COPY
//						GPRS_RetryCtrol.rtyLen = usPacketLen; 
//						memcpy(GPRS_RetryCtrol.rtyBuff,Packet,usPacketLen);
//				#endif
//				#if DEBUG_LOG
//						BSP_LOG("status mess upload\r\n");
//				#endif
//				}
//						break;	
//			
//				case UPLOAD_ID_HEARTBEAT:
//				{
//						usPacketLen = APP_GPRS_GetPacket(HEARTBEAT_ID,HEARTBEAT_CTROL_CODE,HEARTBEAT_LEN,Packet);
//				#if CONFIG_RETRY_COPY            
//						GPRS_RetryCtrol.rtyLen = usPacketLen;                   //ÏûÏ¢³¤¶È±¸·Ý
//						memcpy(GPRS_RetryCtrol.rtyBuff,Packet,usPacketLen);     //ÏûÏ¢±¸·Ý   
//				#endif
//				#if DEBUG_LOG
//						BSP_LOG("send heartbeat mess\r\n");
//				#endif
//				}
//						break; 

				default:
						break;
		}
		return usPacketLen;
}

//static void APP_GPRS_SetIP(U8 *pFrameDes)
//{
//    U8 i=0;
//    U8 ipLen=0;
//    U8 portLen=0;
//    U8 data[6]={0};
//    U8 *ip = GPRS_NetPar.ServerIp;
//    U8 *port=NULL;
//    ipLen = strlen((char*)ip);
//    port = DecimalToASCII(GPRS_NetPar.ServerPort,data); //¶Ë¿ÚºÅ×ª»»Ö§³Ö1--65535
//    if(port != NULL)
//    {
//        portLen=strlen((char*)port);
//        pFrameDes[0] = '"';
//        for(i=0;i<ipLen;i++)
//        {
//           pFrameDes[i+1]=ip[i];
//        }
//        pFrameDes[ipLen+1] = '"';
//        pFrameDes[ipLen+2] = ',';
//        for(i=0;i<portLen;i++)
//        {
//           pFrameDes[ipLen+3+i]=port[i];
//        }
//        pFrameDes[ipLen+portLen+3]=',';
//        pFrameDes[ipLen+portLen+4]='0';
//        pFrameDes[ipLen+portLen+5]='\r';
//        pFrameDes[ipLen+portLen+6]='\n';
//        pFrameDes[ipLen+portLen+7]='\0';
//        return ;
//    }
//    //¶Ë¿ÚºÅ×ª»»³ö´í£¬´òÓ¡ÐÅÏ¢
//    
//}

static uint8_t APP_NB_WriteATPacket(uint8_t ATCmdIndex, uint8_t *pFrameDes)
{  
    uint8_t ucSendLen;
    uint8_t dataNum;
    char *endStr="\x1A\r\n";
		switch(ATCmdIndex)
		{
//				case NB_AT_MIPOPEN_1:/*½¨Á¢socketÁ¬½Ó*/
//				{
//						strcpy((char*)pFrameDes, AT_CmdTbl[ATCmdIndex].CmdStr);  
//						dataNum = Get_Comma(2, (uint8_t*)pFrameDes);
//						APP_GPRS_SetIP(&pFrameDes[dataNum]);			    
//						ucSendLen = strlen((char*)pFrameDes);
//					
//				}break;
//				
//				case NB_AT_DATA:/*Ìî³äÊý¾ÝÄÚÈÝ*/
//				{
//						memcpy(pFrameDes, g_stNB_Handler.TxBuf, g_stNB_Handler.ucTxLen);/*copy Ó¦ÓÃ²ãÊý¾Ý*/
//						ucSendLen = strlen(endStr);
//						memcpy(pFrameDes+g_stNB_Handler.ucTxLen,endStr,ucSendLen);        /*copy ½áÎ²·û*/
//						ucSendLen += g_stNB_Handler.ucTxLen;
//					
//				}break;
				
				default:
				{
						strcpy((char*)pFrameDes, AT_CmdTbl[ATCmdIndex].CmdStr);
						ucSendLen = strlen(AT_CmdTbl[ATCmdIndex].CmdStr);//Ä¬ÈÏµÄÖ¸Áî·û³¤¶È
					
				}break;
		}
		return ucSendLen;    
}


static void APP_NB_SendATCmd(AT_CMD_CB* pNBATCmdCB)
{
		uint8_t ucResendCnt;
		uint8_t ATCmdIndex;
		AT_CMD_CB *pAtCmd = pNBATCmdCB;
		ATCmdIndex = pAtCmd->ATCmdPt;
		if(1 == pAtCmd->Busy)
		{
			return ;//µ±Ç°Ã¦Âµ×´Ì¬
		}
		//¸ù¾Ý²»Í¬µÄATÓ¦´ð½á¹û,ÉèÖÃÖØ·¢´ÎÊý
		if((BACK_TRUE == pAtCmd->ATCmdResult) || (BACK_PERTIMES_OUT == pAtCmd->ATCmdResult))
		{
			ucResendCnt = 0;//ÖØ·¢ÇåÁã
		}
		else
		{
				ucResendCnt = NB_ATCmdCB.ucResendCnt;//±¸·ÝÖØ·¢´ÎÊý
		}

		memset((uint8_t*)pAtCmd, 0, sizeof(NB_ATCmdCB));
		
		pAtCmd->Busy         = 1;          //ÉèÖÃÃ¦ÂÌ×´Ì¬
		pAtCmd->ATCmdPt      = ATCmdIndex; //¸üÐÂATË÷ÒýºÅ
		pAtCmd->ATCmdResult  = NO_BACK;
		pAtCmd->ucResendCnt  = ucResendCnt;  
		pAtCmd->ucResendTimes = AT_CmdTbl[ATCmdIndex].ucResendTimes;
		pAtCmd->ulTimeOut    = TmrSecondsToMilliseconds(AT_CmdTbl[ATCmdIndex].usTimeOut);//Ë¢ÐÂ³¬Ê±Ê±¼ä

		////// Ìî³äÖ¸ÁîÄÚÈÝ³¤¶È //////
		pAtCmd->ucCmdStrLen = APP_NB_WriteATPacket(ATCmdIndex, pAtCmd->CmdStr);
		//Ìî³äÖ¸Áî·ûÆÚÍû½á¹û	
		strcpy(pAtCmd->ExpResultStr, AT_CmdTbl[ATCmdIndex].ExpResultStr);
		//·¢ËÍATÖ¸Áî
		NB_SendATCmdStr(pAtCmd->CmdStr, pAtCmd->ucCmdStrLen);
		//·¢ËÍ´ÎÊý+1
		pAtCmd->ucResendCnt++;
}

static void APP_NB_State_Init_Proc(uint8_t *RxBuf)
{
		uint8_t ATCmdIndex;
		if(g_stNB_Handler.StepPt >= INIT_STEP_NUM)
		{
				return;	
		}	 
		ATCmdIndex = s_ATCmdStep_Init[g_stNB_Handler.StepPt];
		//////////////////////// ATÖ¸ÁîÓ¦´ðÕýÈ· ///////////////////////////	
		if(BACK_TRUE == NB_ATCmdCB.ATCmdResult)//ATÖ¸ÁîÓ¦´ðÄÚÈÝÕýÈ·
		{
				//next Step
				g_stNB_Handler.StepPt++;
				if(g_stNB_Handler.StepPt >= INIT_STEP_NUM)
				{
						////// GPRSÄ£¿é×´Ì¬ÇÐ»» ///////////////
						g_stNB_Handler.State = NB_STATE_READ_MESS;//ÇÐ»»µ½ÏÂÒ»¸öÁ÷³Ì
						g_stNB_Handler.StepPt = 0;     //clr step
						NB_NetPar.NetType = NET_NO_NET;//ÎÞÁªÍø×´Ì¬×´Ì¬
				}
				else
				{
						g_stNB_Handler.State = NB_STATE_INIT;//¼ÌÐøµ±Ç°Á÷³Ì		
				}	
		}
		//////////////////////// AT Ö¸Áî´ïµ½ÖØ·¢´ÎÊý //////////////////////////	
		else if(BACK_PERTIMES_OUT == NB_ATCmdCB.ATCmdResult)//ATÖ¸ÁîÖØ·¢´ÎÊýµ½ÁË
		{
				switch(ATCmdIndex)
				{
						default:
						{
								#if SEGGER_RTT_DEBUG_INIT
										SEGGER_RTT_printf(0, "Init Reset\r\n");
								#endif
								g_stNB_Handler.State = NB_STATE_RESET;       //½øÐÐ¸´Î»
								g_stNB_Handler.StepPt = 0;//clr step
								NB_NetPar.NetType = NET_NO_NET;
						}
							break;	
				}
		}
		//////////////////////// ATÖ¸ÁîÓ¦´ð´íÎó»ò³¬Ê± /////////////////////////	
		else
		{
				//Ã»ÓÐµ½ATÖ¸ÁîÖØ·¢´ÎÊý£¬ËùÒÔÔÙ´Î·¢ËÍATÖ¸Áî
				g_stNB_Handler.State = NB_STATE_WAIT_ACK;//Ö±½ÓÔÙ´Î·¢ËÍATÖ¸Áî£¬È»ºóµÈ´ýÓ¦´ð
				NB_ATCmdCB.ATCmdPt = s_ATCmdStep_Init[g_stNB_Handler.StepPt];
				NB_ATCmdCB.SendATCmdEn = 1;//enable send ATCmd
		}	
}

static void APP_NB_State_Connect_Proc(uint8_t *RxBuf)
{
    uint8_t ATCmdIndex;
	
		if(g_stNB_Handler.StepPt >= CONNECT_STEP_NUM)
		{
				return;	
		}
	
		ATCmdIndex = s_ATCmdStep_Connnect[g_stNB_Handler.StepPt];
		//////////////////////// ATÖ¸ÁîÓ¦´ðÕýÈ· ///////////////////////////	
		if(BACK_TRUE == NB_ATCmdCB.ATCmdResult)//ATÖ¸ÁîÓ¦´ðÄÚÈÝÕýÈ·
		{	           
				//next Step
				g_stNB_Handler.StepPt++;
				if(g_stNB_Handler.StepPt >= CONNECT_STEP_NUM)
				{
						////// NBÄ£¿é×´Ì¬ÇÐ»» ///////////////
						g_stNB_Handler.State = NB_STATE_IDLE;//ÇÐ»»µ½ÏÂÒ»¸öÁ÷³Ì
						g_stNB_Handler.StepPt = 0;//clr step
						NB_NetPar.NetConnSta = CONN_ON;
				}
				else
				{
						g_stNB_Handler.State = NB_STATE_CONNECT_NET;//¼ÌÐøµ±Ç°Á÷³Ì
				}			
		}
		//////////////////////// AT Ö¸Áî´ïµ½ÖØ·¢´ÎÊý //////////////////////////	
		else if(BACK_PERTIMES_OUT == NB_ATCmdCB.ATCmdResult)
		{
				switch(ATCmdIndex)
				{
//						case NB_AT_MIPCALL_1:   //Ö±½Ó¿ªÊ¼ÏÂÒ»ÌõÖ¸Áî
//						{
//								g_stNB_Handler.StepPt++;
//								g_stNB_Handler.State = NB_STATE_CONNECT_NET; //¼ÌÐøµ±Ç°Á÷³Ì
//						}
//								break;
						
						default:
						{
								#if SEGGER_RTT_DEBUG_CONN
										SEGGER_RTT_printf(0, "Connect Reset\r\n");
								#endif
								g_stNB_Handler.State = NB_STATE_RESET;       //½øÐÐ¸´Î»
								g_stNB_Handler.StepPt = 0;//clr step
								NB_NetPar.NetType = NET_NO_NET;
						}
								break;	
				}	
		}
		//////////////////////// ATÖ¸ÁîÓ¦´ð´íÎó»ò³¬Ê± /////////////////////////	
		else
		{
				//Ã»ÓÐµ½ATÖ¸ÁîÖØ·¢´ÎÊý£¬ËùÒÔÔÙ´Î·¢ËÍATÖ¸Áî
				g_stNB_Handler.State = NB_STATE_WAIT_ACK;//Ö±½ÓÔÙ´Î·¢ËÍATÖ¸Áî£¬È»ºóµÈ´ýÓ¦´ð
				NB_ATCmdCB.SendATCmdEn = 1;//enable send ATCmd	
				NB_ATCmdCB.ATCmdPt = s_ATCmdStep_Connnect[g_stNB_Handler.StepPt];
		}	
}

static void APP_NB_State_Mess_Proc(uint8_t *RxBuf)
{
		uint8_t i;
		uint8_t ATCmdIndex;
//		uint8_t asi_len=0;
//		char *str = "898";
		char *p   = NULL;
		if(g_stNB_Handler.StepPt >= MESS_STEP_NUM)
		{
				return; 
		}   
		ATCmdIndex = s_ATCmdStep_Mess[g_stNB_Handler.StepPt];
		//////////////////////// ATÖ¸ÁîÓ¦´ðÕýÈ· ///////////////////////////	 
		if(BACK_TRUE == NB_ATCmdCB.ATCmdResult)//ATÖ¸ÁîÓ¦´ðÄÚÈÝÕýÈ·
		{
				switch(ATCmdIndex)
				{
						case NB_AT_CGSN_1:
						{
								//save cgsn
								p = strstr((char*)RxBuf, "CGSN:");
								#if SEGGER_RTT_DEBUG_MESS
										SEGGER_RTT_printf(0, "cmd cgsn\r\n");
								#endif
								if(p != NULL)
								{
										for (i = 0; i < 16; i ++)
										{
												if (((p[5 + i] < '0') || (p[5 + i] > '9')) && 
														((p[5 + i] < 'a') || (p[5 + i] > 'z')) && 
														((p[5 + i] < 'A') || (p[5 + i] > 'Z')))
												{
														break;
												}
										}
										if (i < 16) p[5 + i] = 0x00;
										memcpy(NB_CommPacket.AuthData.imei, p+5, i);
								#if SEGGER_RTT_DEBUG_MESS
										SEGGER_RTT_printf(0, "len = %u, imei:%s. \r\n", i, NB_CommPacket.AuthData.imei);
								#endif
										//Ascii_To_Hex(p, NB_CommPacket.AuthData.imei, (uint16_t)asi_len); 
										Set_Task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);
								}
						}
								break;	
						
