han-kaka/UEL020100/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/code/app/app_comm_NB86.c
						case NB_AT_NCCID:
						{
								//save nccid
								p=strstr((char*)RxBuf, "NCCID:");
								#if SEGGER_RTT_DEBUG_MESS
										SEGGER_RTT_printf(0, "cmd nccid\r\n");
								#endif
								if(p != NULL)
								{
										for (i = 0; i < 32; i ++)
										{
												if (((p[6 + i] < '0') || (p[6 + i] > '9')) && 
														((p[6 + i] < 'a') || (p[6 + i] > 'z')) && 
														((p[6 + i] < 'A') || (p[6 + i] > 'Z')))
												{
														break;
												}
										}
										if (i < 32) p[6 + i] = 0x00;
										
										memcpy(NB_CommPacket.AuthData.iccid, p+6, i);
								#if SEGGER_RTT_DEBUG_MESS
										SEGGER_RTT_printf(0, "len = %u, nccid:%s. \r\n", i, NB_CommPacket.AuthData.iccid);
								#endif
										Set_Task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);
								}
						}
								break;	
				
						default:
								break;
				}
				//next Step
				g_stNB_Handler.StepPt++;
				if(g_stNB_Handler.StepPt >= MESS_STEP_NUM)
				{
						////// NBÄ£¿é×´Ì¬ÇÐ»» ///////////////
						g_stNB_Handler.State = NB_STATE_CONNECT_NET;//ÇÐ»»µ½ÏÂÒ»¸öÁ÷³Ì
						g_stNB_Handler.StepPt = 0;     //clr step
				}
				else
				{
						g_stNB_Handler.State = NB_STATE_READ_MESS;//¼ÌÐøµ±Ç°Á÷³Ì
				}   
		}
		//////////////////////// AT Ö¸Áî´ïµ½ÖØ·¢´ÎÊý //////////////////////////	
		else if(BACK_PERTIMES_OUT == NB_ATCmdCB.ATCmdResult)//ATÖ¸ÁîÖØ·¢´ÎÊýµ½ÁË
		{
				#if SEGGER_RTT_DEBUG_MESS
						SEGGER_RTT_printf(0, "Mess Reset\r\n");
				#endif
				g_stNB_Handler.State = NB_STATE_RESET;  //½øÐÐ¸´Î»
				g_stNB_Handler.StepPt = 0;//clr step
				NB_NetPar.NetType = NET_NO_NET;
		}
		//////////////////////// ATÖ¸ÁîÓ¦´ð´íÎó»ò³¬Ê± /////////////////////////
		else
		{
				//Ã»ÓÐµ½ATÖ¸ÁîÖØ·¢´ÎÊý£¬ËùÒÔÔÙ´Î·¢ËÍATÖ¸Áî
				g_stNB_Handler.State = NB_STATE_WAIT_ACK;//Ö±½ÓÔÙ´Î·¢ËÍATÖ¸Áî£¬È»ºóµÈ´ýÓ¦´ð
				NB_ATCmdCB.ATCmdPt = s_ATCmdStep_Mess[g_stNB_Handler.StepPt];
				NB_ATCmdCB.SendATCmdEn = 1;//enable send ATCmd
		}
}

static void APP_NB_State_Comm_Proc(uint8_t *RxBuf)
{
//    U8 ATCmdIndex;  
//    static U8 errCnt=0;
//	if(g_stGPRS_Handler.StepPt >= COMM_STEP_NUM)
//	{
//		return;	
//	} 
//	ATCmdIndex = s_ATCmdStep_Comm[g_stGPRS_Handler.StepPt];
///************************ATÖ¸ÁîÓ¦´ðÕýÈ·¡¤**************************/	
//	if(BACK_TRUE == GPRS_ATCmdCB.ATCmdResult)/*ATÖ¸ÁîÓ¦´ðÄÚÈÝÕýÈ·*/
//	{
//		switch(ATCmdIndex)
//		{
//			case GPRS_AT_DATA:
//            {
//				
//				if(RESPOND_TYPE == g_stGPRS_Handler.ucSendType)
//				{
//				    GPRS_Event_Clr(GPRS_EvtProc.ucRespondEvt,(0x01 << g_stGPRS_Handler.ucDataID));
//				}
//				else if(RTY_TYPE == g_stGPRS_Handler.ucSendType)
//				{
//				    GPRS_Event_Clr(GPRS_EvtProc.ucRetryEvt,(0x01 << g_stGPRS_Handler.ucDataID));
//		            APP_GPRS_RefreshRetryMess();
//				}
//				else if(UPLOAD_TYPE == g_stGPRS_Handler.ucSendType)
//				{
//				    /*±¾´ÎÍ¨Ñ¶Íê³É,Çå³ý¶ÔÓ¦µÄÊÂ¼þ*/
//				    GPRS_Event_Clr(GPRS_EvtProc.ucUploadEvt,(0x01 << g_stGPRS_Handler.ucDataID));
//				    //ÈçÔÚÕâÀïÖÃÆðÊÂ¼þ£¬ÔòÐèµÈµ½Ó¦´ð²ÅÄÜ·¢ËÍÏÂÒ»ÌõÖ÷¶¯ÉÏ´«ÏûÏ¢            
//				    GPRS_Event_Set(GPRS_EvtProc.ucDelayEvt,(0x01 << g_stGPRS_Handler.ucDataID));     
//                    APP_GPRS_RefreshRetryMess();
//				}
//				GPRS_Event_Clr(g_stGPRS_Handler.ucCommEvent,(0x01 << g_stGPRS_Handler.ucDataID));
//		        errCnt=0;           /*ATÖ¸Áî³É¹¦£¬Çå³ý´íÎó¼ÆÊý*/
//		        GPRS_TimProc.heartbeatCount = 0;      /*ÐÄÌø¼ÆÊýÇåÁã*/
//			}break;	
//			
//			default:
//				break;	
//		}
//		/*next Step*/
//		g_stGPRS_Handler.StepPt++;
//		if(g_stGPRS_Handler.StepPt >= COMM_STEP_NUM)
//		{
//			/******GPRSÄ£¿é×´Ì¬ÇÐ»»***************/
//			/*Êý¾Ý±êÇ©À´ÅÐ¶ÏÊÇ·ñ»¹ÓÐÆäËüÊý¾ÝÐèÒª·¢ËÍ£¬Èç¹ûÓÐÔòÔÙ´Î½øÈëcomm£¬Ã»ÓÐÔòÍË³öÍ¨Ñ¶×´Ì¬*/
//			if(APP_GPRS_EvtTraverse(TRAVERSE) == FALSE)
//			{
//                g_stGPRS_Handler.State = GPRS_STATE_IDLE;/*ÇÐ»»µ½ÏÂÒ»¸öÁ÷³Ì*/
//				g_stGPRS_Handler.ucCommBusy= 0;/*Comm Complete*/
//			}
//			else
//			{
//				g_stGPRS_Handler.State = GPRS_STATE_COMM;/*¼ÌÐøµ±Ç°Á÷³Ì*/		
//			}
//			
//			g_stGPRS_Handler.StepPt = 0;/**clr step*/
//		}
//		else
//		{
//		    g_stGPRS_Handler.State = GPRS_STATE_COMM;/*¼ÌÐøµ±Ç°Á÷³Ì*/		
//		}		
//	}
///************************AT Ö¸Áî´ïµ½ÖØ·¢´ÎÊý**************************/	
//	else if(BACK_PERTIMES_OUT == GPRS_ATCmdCB.ATCmdResult)
//	{
//	    if(GPRS_AT_DATA == ATCmdIndex)
//	    {
//	        g_stGPRS_Handler.State = GPRS_STATE_COMM;
//	        errCnt++;
//	    }
//	    else if((GPRS_AT_MIPSEND_1 == ATCmdIndex) || (errCnt > 3))
//	    {
//            #if DEBUG_LOG
//                  BSP_LOG("Comm Reset\r\n");
//            #endif
//            errCnt=0;
//	        g_stGPRS_Handler.State = GPRS_STATE_RESET;
//	        GPRS_NetPar.NetType = NET_NO_NET;
//	    }
//	    
//		g_stGPRS_Handler.StepPt = 0;/**clr step*/
//		g_stGPRS_Handler.ucCommBusy= 0;	

//	}
///************************ATÖ¸ÁîÓ¦´ð´íÎó»ò³¬Ê±*************************/	
//	else
//	{
//		/*Ã»ÓÐµ½ATÖ¸ÁîÖØ·¢´ÎÊý£¬ËùÒÔÔÙ´Î·¢ËÍATÖ¸Áî*/
//		g_stGPRS_Handler.State = GPRS_STATE_WAIT_ACK;/*Ö±½ÓÔÙ´Î·¢ËÍATÖ¸Áî£¬È»ºóµÈ´ýÓ¦´ð*/
//        GPRS_ATCmdCB.SendATCmdEn = 1;/*enable send ATCmd*/
//		GPRS_ATCmdCB.ATCmdPt = s_ATCmdStep_Comm[g_stGPRS_Handler.StepPt];
//	} 
}

/*Èç¹û·þÎñÆ÷ÏÂ·¢Êý¾Ý²»¼Ó±êÊ¶Í·£¬´Ëº¯Êý¿É·ÅÈëATÖ¸Áî½âÎöÖÐ*/

//U8 APP_GPRS_RxDataCheck(U8 *rxBuff)   
//{
//    U8 i=0;
//    U8 rxLen=rxBuff[10]+13;
//    if(rxBuff[0] != FRAME_HEAD)       return FALSE;  //Ö¡Í·Ð£Ñé
//    if(rxBuff[1] != 0x02)       return FALSE;        //²úÆ·ÀàÐÍÐ£Ñé
//    for(i=0;i<4;i++)
//    {
//        if(rxBuff[i+2] != PacketHead.addrRegion[i])  //µØÖ·ÓòÐ£Ñé
//            return FALSE;
//    }
//    if(rxBuff[rxLen-1] != FRAME_END)   return FALSE;
//    if(FALSE == Xor_Check(rxBuff,rxLen))             //ºÍÐ£Ñé
//    {
//        return FALSE;
//    }
//    #if DEBUG_LOG
//    BSP_LOG("DECODE TRUE\r\n");
//    #endif
//    return TRUE;
//}
//static void APP_GPRS_RxDataDecode(U8 *rxBuff)
//{
//    U8 i=0;
//    U8 *p_buf=rxBuff+14;
//    U8 ctrCode  = rxBuff[9];
//  //  U8 dataLen  = rxBuff[10];
//    U16 command = ((U16)(rxBuff[11])<<8) + rxBuff[12]; 
//    U8 flowNum= rxBuff[13];
//    switch(ctrCode)
//    {
//         case WRITE_CTROL_CODE:             /*·þÎñÆ÷ÏÂ·¢Ð´Êý¾Ý°ü*/
//         {
//             PacketHead.AckMeageFlowNum = flowNum;
//             switch(command)
//             {
//                 case SET_PARMTE_ID:       //ÉèÖÃ²ÎÊý
//                 {
//                      for(i=0;i<SERVER_IP_LEN;i++)
//                      {
//                           GPRS_NetPar.ServerIp[i] = p_buf[i];
//                      }
//                      GPRS_NetPar.ServerPort = ((U16)(p_buf[SERVER_IP_LEN]<<8)+p_buf[SERVER_IP_LEN+1]);
//                      for(i=0;i<SERVER_APN_LEN;i++)
//                      {
//                           GPRS_NetPar.ServerApn[i] = p_buf[SERVER_IP_LEN+2+i];
//                      }
//                      GPRS_Event_Set(GPRS_EvtProc.ucRespondEvt,COMM_Event_SET_PARMTE);
//                      Set_Task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);//ÖÃÆð´æ´¢ÈÎÎñ
//                 }
//                 break;
//                 case WRITE_ADDR_ID:      //Ð´µØÖ·
//                 {
//                      for(i=0;i<4;i++)
//                      {
//                            PacketHead.addrRegion[i] = p_buf[i];
//                      }
//                      GPRS_Event_Set(GPRS_EvtProc.ucRespondEvt,COMM_Event_WRITE_ADDR);
//                      Set_Task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);//ÖÃÆð´æ´¢ÈÎÎñ
//                 }
//                 break;
//                 case SYS_PARMTE_SET_ID:  //ÏµÍ³²ÎÊýÉèÖÃ
//                 {
//                      Charge_ThresValue.PulloutTime     = (U16)((p_buf[0]<<8)+p_buf[1]);
//                      Charge_ThresValue.DeviationValue  = (U16)((p_buf[2]<<8)+p_buf[3]);
//                      GPRS_Event_Set(GPRS_EvtProc.ucRespondEvt,COMM_Event_SYS_PARMTE_SET);
//                      Set_Task(MEM_WRITE, MEM_STORE_DYNAMIC_DATA);//ÖÃÆð´æ´¢ÈÎÎñ
//                 }
//                 break;
//                 default:
//                    break;
//             }
//         }
//         break;
//         case READ_CTROL_CODE:              /*·þÎñÆ÷ÏÂ·¢¶ÁÊý¾Ý°ü*/
//         {
//             PacketHead.AckMeageFlowNum = flowNum;
//             switch(command)
//             {
//                 case QUERY_PARMTE_ID:      //²éÑ¯²ÎÊýÉèÖÃ
//                 {
//                       GPRS_Event_Set(GPRS_EvtProc.ucRespondEvt,COMM_Event_QUERY_PARMTE);
//                 }
//                 break;
//                 case READ_MESS_ID:         //¶ÁÐÅÏ¢
//                 {
//                       if(g_stGPRS_Handler.ucCommBusy == 0)
//                       {
//                            //ÕâÀïÔÙ¶ÁÒ»´ÎÐÅºÅÇ¿¶È
//                            g_stGPRS_Handler.StateOld = g_stGPRS_Handler.State; 
//		                    g_stGPRS_Handler.State = GPRS_STATE_READ_MESS;        //ÖØÐÂ¶ÁÈ¡ÐÅÏ¢
//		                    g_stGPRS_Handler.StepPt = 0;
//		               }
//		               GPRS_Event_Set(GPRS_EvtProc.ucRespondEvt,COMM_Event_READ_MESS);
//		               
//                 }
//                 break;
//                 case READ_ADDR_ID:         //¶ÁµØÖ·
//                 {
//                       GPRS_Event_Set(GPRS_EvtProc.ucRespondEvt,COMM_Event_READ_ADDR);
//                 }
//                 break;
//                 case READ_STA_MESS_ID:         //¶ÁµØÖ·
//                 {
//                       GPRS_Event_Set(GPRS_EvtProc.ucRespondEvt,COMM_Event_READ_STA_MESS);
//                 }
//                 break;
//                 default:
//                    break;
//             }
//         }
//         break;
//         case CONTROL_CTROL_CODE:           /*·þÎñÆ÷ÏÂ·¢¿ØÖÆ°ü*/
//         {
//             PacketHead.AckMeageFlowNum = flowNum;
//             if(command == CONTROL_ID)      //¿ØÖÆ°ü
//             {
//                 Charge_ThresValue.ChargeTime =  (U16)((p_buf[0]<<8)+p_buf[1]);
//                 if(Charge_ThresValue.ChargeTime != 0) 
//                 {
//                    Charge_Flag.ChargeAction = ENABLE;
//                    Charge_Flag.ChargeStatus = CHARGE_ENABLE;
//                 }
//                 else
//                 {
//                    g_stCharge_Handler.State = STATE_CHARGE_OFF;
//                    Charge_Flag.ChargeStatus = CHARGE_DISABLE;
//                    g_stCharge_Handler.CloseType = CLOSE_CMD;
//                 }
//                 Set_Task(MEM_WRITE,MEM_STORE_DYNAMIC_DATA);
//                 GPRS_Event_Set(GPRS_EvtProc.ucRespondEvt,COMM_Event_CTROL);
//             }
//         }
//         break;
//         case UPLOAD_CTROL_CODE:            /*·þÎñÆ÷·µ»ØÖ÷¶¯ÉÏ´«°ü*/
//         {
//             PacketHead.TerminalMeageFlowNum++;
//             switch(command)
//             {
//                 case AUTHENTICA_ID:       //µÇÂ¼°ü·µ»Ø
//                 {
//                    //µÇÂ¼³É¹¦
//                    APP_GPRS_RetryMessInit();
//                    g_stGPRS_Handler.AuthStatus = AUTH;
//                    GPRS_Event_Clr(GPRS_EvtProc.ucDelayEvt,COMM_Event_AUTH); 
//                 }
//                 break;
//                 case STA_MESS_ID:         //×´Ì¬ÐÅÏ¢°ü·µ»Ø
//                 {
//                    APP_GPRS_RetryMessInit();
//                    GPRS_Event_Clr(GPRS_EvtProc.ucDelayEvt,COMM_Event_STA_MESS);
//                 }
//                 break;
//                 case HEARTBEAT_ID:       //ÐÄÌø°ü·µ»Ø
//                 {
//                    //ÐÄÌø°ü·¢ËÍ³É¹¦
//                    APP_GPRS_RetryMessInit();
//                    GPRS_Event_Clr(GPRS_EvtProc.ucDelayEvt,COMM_Event_HEARTBEAT);
//                 }
//                 break;

//                 default:
//                    break;
//             }
//         }
//         break;
//         default:
//                 break;
//    }
//}

