han-kaka/UEL020100/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/code/app/app_comm_NB86.c
static void APP_NB_EventProc(uint8_t surEvt, uint8_t* objEvt)
{
    uint8_t ucID=0;
    if(false == NB_Event_IsEmpty(surEvt)) 
    {
				ucID = Get_CommEvent(surEvt);
				NB_Event_Set(*objEvt, (1<<ucID));
    }
}

static uint8_t APP_NB_EvtTraverse(uint8_t mode)
{    
//    if(false == NB_Event_IsEmpty(NB_EvtProc.ucRespondEvt))
//    {
//        if(mode == TRAVERSE_AND_ADDEVT)  APP_NB_EventProc(NB_EvtProc.ucRespondEvt,&g_stNB_Handler.ucCommEvent);
//        return RESPOND_TYPE;
//    }
//    else if(false == NB_Event_IsEmpty(NB_EvtProc.ucDelayEvt))
//    {        
//        if(NB_Event_IsEmpty(NB_EvtProc.ucRetryEvt)== false)
//        {
//            if(mode == TRAVERSE_AND_ADDEVT)  APP_NB_EventProc(NB_EvtProc.ucRetryEvt,&g_stNB_Handler.ucCommEvent);
//            return RTY_TYPE;
//        }
//        return 0;
//    }
//    else if(false == NB_Event_IsEmpty(NB_EvtProc.ucUploadEvt))
//    {
//        if(mode == TRAVERSE_AND_ADDEVT)  APP_NB_EventProc(NB_EvtProc.ucUploadEvt,&g_stNB_Handler.ucCommEvent);
//        return UPLOAD_TYPE;
//    }
	
    if(false == NB_Event_IsEmpty(NB_EvtProc.ucUploadEvt))
    {
        if(mode == TRAVERSE_AND_ADDEVT)  APP_NB_EventProc(NB_EvtProc.ucUploadEvt, &g_stNB_Handler.ucCommEvent);
        return UPLOAD_TYPE;
    }
    else if(false == NB_Event_IsEmpty(g_stNB_Handler.ucCommEvent))
    {
        //ÀíÂÛÉÏ³ÌÐòÎÞ·¨ÔËÐÐµ½ÕâÀï
        g_stNB_Handler.ucCommEvent = 0;
    #if SEGGER_RTT_DEBUG_NB86
        SEGGER_RTT_printf(0, "Event is Error \r\n");
    #endif
        return 0;
    }
    else
    {
        g_stNB_Handler.State = NB_STATE_IDLE;  //ÇÐ»»ÖÁIDLEÌ¬
        return 0;
    }
}

static void APP_NB_Reset_Init(void)
{                 
    //ÑÓÊ±ÊÂ¼þÌí¼ÓÖÁÖ÷¶¯ÉÏ´«ÊÂ¼þÖÐ
    //Ðè°ÑÑÓÊ±ÊÂ¼þÈ«²¿Ìí¼ÓÖÁÖ÷¶¯ÉÏ´«ÊÂ¼þÖÐ
//    APP_NB_EventProc(NB_EvtProc.ucDelayEvt, &NB_EvtProc.ucUploadEvt);  
    g_stNB_Handler.AuthStatus = NOT_AUTH;
    NB_Event_Set(NB_EvtProc.ucUploadEvt, COMM_Event_INIT);
//    NB_EvtProc.ucRespondEvt =0;
//    NB_EvtProc.ucRetryEvt =0;
//    NB_EvtProc.ucDelayEvt =0;
    g_stNB_Handler.ucCommEvent = 0;
    NB_NetPar.NetType = NET_NO_NET;           //ÎÞÍøÂç×´Ì¬Á¬½Ó
    NB_NetPar.NetConnSta = CONN_OFF;
    APP_NB_RetryMessInit();                   //ÖØ´«Ïà¹Ø±äÁ¿³õÊ¼»¯
}

void APP_COMM_Init(void)
{    
#if DEBUG_TROPE_FUN
    PacketHead.TerminalMeageFlowNum = 0x19;
#endif
		g_stNB_Handler.State = NB_STATE_POWER_ON; 
		g_stNB_Handler.StateOld = NB_STATE_POWER_ON; 
		g_stNB_Handler.StepPt = 0;
		g_stNB_Handler.AuthStatus = NOT_AUTH;
//		BSP_NB_POWERON_SET;
//		nrf_delay_us(1000); 
//		BSP_NB_RESET_SET
//		while(1)
//		{}
		NB_Event_Set(NB_EvtProc.ucUploadEvt, COMM_Event_INIT);//ÉÏµçÐè·¢ËÍÒ»¸öµÇÂ¼°ü
		Set_Task(COMM, COMM_STATE_PROC);     //Æô¶¯GPRS×´Ì¬´¦ÀíÈÎÎñ
}

void APP_NB_TimeProc(uint16_t usPeriod)
{
    NB_msCount += usPeriod;
//    if(GPRS_ATCmdCB.Busy == 1)   //ÔÚÊý¾Ý½ÓÊÕÊ±£¬ATÖ¸ÁîÒ²Ã¦Âµ£¬Õâ±ß¿ÉÄÜ»áÓÐ³åÍ»£¬°Ñ½ÓÊÕÊ±£¬Ã¦Âµ±êÖ¾È¥³ý
//	{
		/*********ATÖ¸ÁîÓ¦´ð³¬Ê±**************/
		if(NB_ATCmdCB.ulTimeOut >= usPeriod)
		{
				NB_ATCmdCB.ulTimeOut -= usPeriod;
				if(NB_ATCmdCB.ulTimeOut < usPeriod)
				{
						NB_ATCmdCB.ATCmdResult = BACK_TIMEOUT;/*³¬Ê±*/ 
				}
		}
//	}
		if(NB_ATCmdCB.ucByteTimeOut >= usPeriod)
		{
				NB_ATCmdCB.ucByteTimeOut -= usPeriod;
				if(NB_ATCmdCB.ucByteTimeOut < usPeriod)
				{
						NB_ATCmdCB.RxFrameOk = 1;
						Set_Task(COMM, COMM_CMD_PROC);
				}
		}
		/***************** NB Ä£¿éÑÓÊ±¼ÆÊ ý*************************/
		if(g_stNB_Handler.ulDelayCnt >= usPeriod)    
		{
				g_stNB_Handler.ulDelayCnt -= usPeriod;
		}
    else
    {
        g_stNB_Handler.ulDelayCnt = 0;
    }
		 /*****************NB Ä£¿é×´Ì¬´¦Àíº¯Êý*************************/	
		g_stNB_Handler.ulProcCtrTaskPer += usPeriod;
		if(g_stNB_Handler.ulProcCtrTaskPer >= SUB_TASK_PROCCTR_PER)
		{
				g_stNB_Handler.ulProcCtrTaskPer -= SUB_TASK_PROCCTR_PER;
				Set_Task(COMM, COMM_STATE_PROC);
		}	
		if(NB_msCount >= NB_MS_TO_S)   //ms to S
		{
				NB_msCount =0;
//				/**************** NB Ä£¿éÖØ´«´¦Àí*************************/
//				if(NB_RetryCtrol.rtycntEn != DISABLE)
//				{
//						NB_RetryCtrol.rtyTimCount++;
//						if(NB_RetryCtrol.rtyTimCount >= NB_RetryCtrol.rtyTime)
//						{
//								NB_RetryCtrol.rtyTimCount=0;
//								NB_RetryCtrol.rtycntEn = DISABLE;
//								APP_NB_EventProc(NB_EvtProc.ucDelayEvt,&NB_EvtProc.ucRetryEvt);
//						}
//				}
				/***************** ÐÄÌø°ü´¦Àí *************************/
				if((NB_NetPar.NetConnSta   == CONN_ON) && (AUTH == g_stNB_Handler.AuthStatus))  /*ÐÄÌø°ü*/
				{
						NB_TimProc.heartbeatCount++;
						if(NB_TimProc.heartbeatCount >= HEARTBEAT_TIME)
						{
								NB_TimProc.heartbeatCount = 0;
//								NB_Event_Set(NB_EvtProc.ucUploadEvt, COMM_Event_HEARTBEAT);
						}
				}
		}
}


/*Ä£¿éATÖ¸Áî½âÎöÈÎÎñ*/
void APP_SubTask_CmdProc(void)
{
		#if SEGGER_RTT_DEBUG_CMDPROC
//			SEGGER_RTT_printf(0, "APP SubTask CmdProc !\r\n");
		#endif
    nrf_uart_disable(NRF_UART0);
//		disableInterrupts();
    NB_ATCmdCB.Busy = 0;   
    NB_ATCmdCB.ucRxLen = NB_ATCmdCB.ucRxCnt;
    NB_ATCmdCB.ucRxCnt = 0;
    NB_ATCmdCB.RxFrameOk = 0;
    memcpy(g_stNB_Handler.RxBuf,NB_ATCmdCB.RxBuf,NB_ATCmdCB.ucRxLen);
    nrf_uart_enable(NRF_UART0);
//		enableInterrupts();

    NB_ATCmdCB.ATCmdResult = APP_GPRS_ATCmdAckCheck(g_stNB_Handler.RxBuf); 
    ////////// Ó¦´ð´íÎóÖ±½Ó·µ»Ø /////////////////////// 
    if(BACK_ERROR == NB_ATCmdCB.ATCmdResult) 
    {
        return;
    }
    ////////// Ó¦´ðATÖ¸ÁîÖ±½Ó·µ»Ø,Í¨¹ýAPP_SubTask_StateProc ´¦Àí ///
    if(RSP_TYPE_CMD == NB_ATCmdCB.RspType)
    {
        return;
    }
    /////////// ¶Ô·þÎñÆ÷µÄÏÂÐÐÊý¾Ý½øÐÐÐ­Òé½âÎöºÍÏàÓ¦´¦Àí ////////////////
    if(RSP_TYPE_DATA == NB_ATCmdCB.RspType)
    {
        Set_Task(COMM,COMM_DECODE);
        #if SEGGER_RTT_DEBUG_NB86
						SEGGER_RTT_printf(0, "START DECODE\r\n");
        #endif
    }  
    NB_ATCmdCB.ATCmdResult = NO_BACK;
}


void APP_SubTask_StateProc(void)
{
		static uint8_t ResetTimesCount = 0;
	
    switch(g_stNB_Handler.State)
    {
				case NB_STATE_WAIT_ACK:
        {
						//Èç¹ûÃ»ÓÐ½á¹û¾ÍÖ±½Ó·µ»Ø
						if(NO_BACK == NB_ATCmdCB.ATCmdResult)
						{
								return;	
						}  
						//ATÓ¦´ð³¬Ê±£¬»òÕßATÖ¸ÁîÓ¦´ð½âÎö´íÎó£¬ÔòÅÐ¶ÏÊÇ·ñÐèÒªÖØ·¢
						if((NB_ATCmdCB.ATCmdResult == BACK_ERROR) || (NB_ATCmdCB.ATCmdResult == BACK_TIMEOUT))  
						{
								if(NB_ATCmdCB.ucResendCnt >= NB_ATCmdCB.ucResendTimes)
								{	
										NB_ATCmdCB.ATCmdResult = BACK_PERTIMES_OUT;//ÖØ·¢´ÎÊýµ½ÁË
								}			
						}
						//¸ù¾Ý²»Í¬µÄ½á¹û£¬×öÏàÓ¦´¦Àí
						if(APP_NB_StateProcTbl[g_stNB_Handler.StateOld] != NULL)
						{
								APP_NB_StateProcTbl[g_stNB_Handler.StateOld](g_stNB_Handler.RxBuf);		
						}
						if((BACK_TRUE == NB_ATCmdCB.ATCmdResult) || (BACK_PERTIMES_OUT == NB_ATCmdCB.ATCmdResult))/*ATÖ¸ÁîÓ¦´ðÄÚÈÝÕýÈ·*/
						{
								//¸üÐÂStateOld
								g_stNB_Handler.StateOld = NB_STATE_WAIT_ACK;
						}
						NB_ATCmdCB.ulTimeOut = 0;
						NB_ATCmdCB.Busy = 0;              
				}
						break;
				 
        case NB_STATE_POWER_ON:
        {
						if(g_stNB_Handler.ulDelayCnt > 0)
						{
								return;
						}
						if(0 == g_stNB_Handler.StepPt)
						{
								BSP_NB_POWERON_CLEAR;
								BSP_NB_RESET_CLEAR
						#if SEGGER_RTT_DEBUG_POWER_ON
								SEGGER_RTT_printf(0, "clear nb poweron and reset !\r\n");
						#endif
								g_stNB_Handler.StepPt++;
								g_stNB_Handler.ulDelayCnt = 1200;      //À­µÍ1.2s
						}
            else if(1 == g_stNB_Handler.StepPt)
						{
								BSP_NB_POWERON_SET;
						#if SEGGER_RTT_DEBUG_POWER_ON
								SEGGER_RTT_printf(0, "set nb poweron !\r\n");
						#endif
								g_stNB_Handler.StepPt++;
								g_stNB_Handler.ulDelayCnt = 100;  //À­¸ß10ms
								LED_Status = CONN_INDI;            //ÕýÔÚÁªÍøLEDÖ¸Ê¾
						}
						else if(2 == g_stNB_Handler.StepPt)
						{
								BSP_NB_RESET_SET;
						#if SEGGER_RTT_DEBUG_POWER_ON
								SEGGER_RTT_printf(0, "set nb reset !\r\n");
						#endif
								g_stNB_Handler.StepPt++;
								g_stNB_Handler.ulDelayCnt = 7000; //µÈ´ý50msºóÔÙ²Ù×÷NBÄ£¿é
						}
						else//next state
						{
								//Ò»Ð©±äÁ¿Çå0
						#if SEGGER_RTT_DEBUG_POWER_ON
								SEGGER_RTT_printf(0, "next state init !\r\n");
						#endif
                NB_NetPar.NetType = NET_NO_NET;//ÎÞÍøÂç×´Ì¬Á¬½Ó
								g_stNB_Handler.StateOld = NB_STATE_POWER_ON;	
								g_stNB_Handler.State = NB_STATE_INIT;//¿ªÊ¼ÏÂÒ»¸öÁ÷³Ì
								g_stNB_Handler.StepPt = 0;	    
						}
				}
						break;
         ///////////// ¸Ã×´Ì¬ÎªGPRSÄ£¿éPOWER_OFF£¬ËùÒÔÖ´ÐÐÍê¸ÃÁ÷³ÌºóÐèPOWER_ON /////////////
         // Èç¸ÃÁ÷³ÌÖ±½ÓÍê³ÉÄ£¿éµÄ¸´Î»£¬ÄÇÃ´Ö´ÐÐÍê¸ÃÁ÷³Ìºó,¿É¿ªÊ¼ATÖ¸ÁîÁ÷³Ì //
				case NB_STATE_RESET:  
        {
						if(g_stNB_Handler.ulDelayCnt > 0)
            {
								return;
            }
            if(0 == g_stNB_Handler.StepPt)
						{
								//Òý½Å²Ù×÷
								BSP_NB_RESET_CLEAR;
								g_stNB_Handler.StepPt++;
								g_stNB_Handler.ulDelayCnt = 200; //À­µÍ200ms
								LED_Status = SYS_INDI;     //ÏµÍ³LEDÖ¸Ê¾
						}
						else if(1 == g_stNB_Handler.StepPt)
						{
								//Òý½Å²Ù×÷
								BSP_NB_RESET_SET;
								g_stNB_Handler.StepPt++;
								g_stNB_Handler.ulDelayCnt = 50;
						}
						else//next state
						{
								//Ò»Ð©±äÁ¿Çå0
                NB_NetPar.NetType = NET_NO_NET;               //ÎÞÍøÂç×´Ì¬Á¬½Ó
								g_stNB_Handler.StateOld = NB_STATE_RESET;	
								g_stNB_Handler.State = NB_STATE_POWER_ON;   //¿ªÊ¼ÏÂÒ»¸öÁ÷³Ì
								g_stNB_Handler.StepPt = 0;	
								APP_NB_Reset_Init();
								ResetTimesCount++;
								if(ResetTimesCount >=3)
								{
										ResetTimesCount = 0;
										Task_Flag_Struct.closeStaProc = ENABLE;
								#if SEGGER_RTT_DEBUG_RESET
										SEGGER_RTT_printf(0, "Close State Proc\r\n");
								#endif
								}
								// Õâ±ßÌí¼Ó¸´Î»´ÎÊý¼ÆÊý£¬Èç³¬¹ýÉè¶¨¸´Î»´ÎÊý£¬ÄÇÃ´ÔÝÊ±²»½øÐÐ¶ÔGPRSµÄ²Ù×÷ //
								//// ¾ßÌåÊµÏÖ¿É¹Ø±Õ¶¨Ê±Æ÷ÀïÃæµÄÖÜÆÚ×´Ì¬´¦Àíº¯Êý /////
						}
        }
						break;
				 
				case NB_STATE_INIT:
        {
						if((g_stNB_Handler.ulDelayCnt > 0) && (Task_Flag_Struct.atReday_F == DISABLE))
            {
								return;
            }
            if(0 == g_stNB_Handler.StepPt)
						{
						#if SEGGER_RTT_DEBUG_INIT
								SEGGER_RTT_printf(0, "init wait nb start !\r\n");
						#endif
								g_stNB_Handler.StepPt++;
								g_stNB_Handler.ulDelayCnt = 20000; //20S NB AT×¼±¸¾ÍÐ÷³¬Ê±Ê±¼ä
						}
						else
						{
						#if SEGGER_RTT_DEBUG_INIT
								SEGGER_RTT_printf(0, "init nb has start !\r\n");
						#endif
								g_stNB_Handler.ulDelayCnt = 0;  //¼ÆÊýÇå0
								Task_Flag_Struct.atReday_F = DISABLE; //AT¾ÍÐ÷Ê§ÄÜ
								g_stNB_Handler.StateOld = g_stNB_Handler.State;
								g_stNB_Handler.State = NB_STATE_WAIT_ACK;
								NB_ATCmdCB.SendATCmdEn = 1; //enable send ATCmd
								NB_ATCmdCB.ATCmdPt = s_ATCmdStep_Init[g_stNB_Handler.StepPt];  
						}
				}
						break;
				
        case NB_STATE_CONNECT_NET:
				{				
						g_stNB_Handler.StateOld = g_stNB_Handler.State; 
						g_stNB_Handler.State = NB_STATE_WAIT_ACK;
						NB_ATCmdCB.SendATCmdEn = 1;//enable send ATCmd
						NB_ATCmdCB.ATCmdPt = s_ATCmdStep_Connnect[g_stNB_Handler.StepPt];
         }
						break;	
				 
