han-kaka/UEL020100/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/code/app/app_comm_NB86.c
        case NB_STATE_READ_MESS:
        {
						if((g_stNB_Handler.ulDelayCnt > 0) && (Task_Flag_Struct.atReday_F == DISABLE))
            {
								return;
            }
            if(0 == g_stNB_Handler.StepPt)
						{
						#if SEGGER_RTT_DEBUG_MESS
								SEGGER_RTT_printf(0, "mess wait nb start !\r\n");
						#endif
								g_stNB_Handler.StepPt++;
								g_stNB_Handler.ulDelayCnt = 20000; //20S GPRS AT×¼±¸¾ÍÐ÷³¬Ê±Ê±¼ä
						}
						else
						{
						#if SEGGER_RTT_DEBUG_MESS
								SEGGER_RTT_printf(0, "mess nb has start !\r\n");
						#endif
								g_stNB_Handler.ulDelayCnt = 0;  //¼ÆÊýÇå0
								Task_Flag_Struct.atReday_F = DISABLE; //AT¾ÍÐ÷Ê§ÄÜ
								g_stNB_Handler.StateOld = g_stNB_Handler.State; 
								g_stNB_Handler.State = NB_STATE_WAIT_ACK;
								NB_ATCmdCB.SendATCmdEn = 1;//enable send ATCmd
								NB_ATCmdCB.ATCmdPt = s_ATCmdStep_Mess[g_stNB_Handler.StepPt];
						}
        }
						break;
				
        case NB_STATE_COMM:
        {
            g_stNB_Handler.ucSendType = APP_NB_EvtTraverse(TRAVERSE_AND_ADDEVT);
            if((false == g_stNB_Handler.ucSendType) || (NB_Event_IsEmpty(g_stNB_Handler.ucCommEvent)))
            {
                break;
            }

						if(0 == g_stNB_Handler.StepPt)
						{
								g_stNB_Handler.ucCommBusy = 1;    //±ê¼ÇÕýÔÚºÍ·þÎñÆ÷Í¨Ñ¶
//								LED_Status = DATA_SEND_INDI;    //ÕýÔÚÍ¨Ñ¶LEDÖ¸Ê¾
						}
            
						if(NB_AT_NMGS == s_ATCmdStep_Comm[g_stNB_Handler.StepPt]) 
						{   
								//APP_NB_WriteReturnIDPacketÓëAPP_NB_WriteDataIDPacketº¯Êý¿ÉÒÔºÏ¶þÎªÒ»
								//µ«¿¼ÂÇµ½ºóÐøÏîÄ¿Ð­Òé¿ÉÄÜÔö¶à£¬×îÖÕ»¹ÊÇµÃ°ÑÖ÷¶¯ÉÏ´«ºÍÓ¦´ðÏûÏ¢·Ö¿ª
								switch(g_stNB_Handler.ucSendType)
								{
//										case RESPOND_TYPE:
//										{
//												g_stNB_Handler.ucDataID = Get_CommEvent(NB_EvtProc.ucRespondEvt);
//												g_stNB_Handler.ucTxLen = (uint8_t)APP_NB_WriteReturnIDPacket(g_stNB_Handler.ucDataID, g_stNB_Handler.TxBuf);
//										}
//												break;
//										
//										case RTY_TYPE:
//										{
//												g_stNB_Handler.ucDataID = Get_CommEvent(NB_EvtProc.ucRetryEvt);
//										#if CONFIG_RETRY_COPY
//												g_stNB_Handler.ucTxLen = (uint8_t)APP_NB_WriteRetryIDPacket(g_stNB_Handler.TxBuf);
//										#else
//												g_stNB_Handler.ucTxLen = (uint8_t)APP_NB_WriteDataIDPacket(g_stNB_Handler.ucDataID, g_stNB_Handler.TxBuf);
//										#endif
//										}
//												break;
//										
										case UPLOAD_TYPE:
										{
												g_stNB_Handler.ucDataID = Get_CommEvent(NB_EvtProc.ucUploadEvt);
												g_stNB_Handler.ucTxLen = (uint8_t)APP_NB_WriteDataIDPacket(g_stNB_Handler.ucDataID, g_stNB_Handler.TxBuf);
										}
												break;
										
										default:
												break;
								}
						}
            //´ËÊ±ÖØ·¢¼ÆÊýÎª3£¬²¢ÇÒÎªµÚÒ»ÌõÖ¸Áî¡£ÒòÎªµÚ¶þÌõÖ¸Áî»á°ÑÖØ´«¼ÆÊý¼Ó1
						if((NB_RetryCtrol.rtycnt >= RTY_TIMES_MAX) && (g_stNB_Handler.StepPt ==0))   
						{
								g_stNB_Handler.StateOld = NB_STATE_RESET;   //¸´Î»GPRSÄ£¿é
								g_stNB_Handler.State = NB_STATE_RESET;
								g_stNB_Handler.StepPt = 0;			    
             #if DEBUG_LOG
                BSP_LOG("Rty Reset\r\n");
             #endif
								return;
						}
						g_stNB_Handler.StateOld = g_stNB_Handler.State; 
						g_stNB_Handler.State = NB_STATE_WAIT_ACK;
						NB_ATCmdCB.SendATCmdEn = 1;//enable send ATCmd 
						NB_ATCmdCB.ATCmdPt = s_ATCmdStep_Comm[g_stNB_Handler.StepPt];
        }
						break;
				
        case NB_STATE_IDLE:
				{
						uint8_t NextStateOffset;
						//ÅÐ¶ÏÊÇ·ñÓÐÊý¾ÝÐèÒªÍ¨Ñ¶
						if(APP_NB_EvtTraverse(TRAVERSE) != false)
						{
								//ÓÐÊý¾ÝÒªÍ¨Ñ¶ÔòÉèÖÃÇÐ»»µ½COM×´Ì¬µÄÊÂ¼þ
								NB_State_Event_Set(STATE_Event_COMM);
						}
									
						if(NB_IsSwitch_State())  //ÏÖ²»×ö´¦Àí£¬ºóÐø¿ÉÓÃ×öµÍ¹¦ºÄ
						{
								break;
						}
						
						//»ñÈ¡ÏÂÒ»¸öÓÅÏÈ¼¶¸ßµÄ×´Ì¬
						NextStateOffset = Get_NextState(g_stNB_Handler.ucStateEvent);
						g_stNB_Handler.State = NB_STATE_COMM + NextStateOffset;
						NB_State_Event_Clr(0x01 << NextStateOffset);
						g_stNB_Handler.StateOld = NB_STATE_IDLE; 
						g_stNB_Handler.StepPt = 0;		
				}
						break;	
				
				default:
				{
						g_stNB_Handler.State = NB_STATE_INIT;
						g_stNB_Handler.StepPt = 0;
				}
						break;
		}
    if(1 == NB_ATCmdCB.SendATCmdEn)
    {
				NB_ATCmdCB.SendATCmdEn = 0;
				APP_NB_SendATCmd(&NB_ATCmdCB);
    }
}


//void APP_SuTask_DecodeProc(void)
//{   
//    U8  TropeBuf[GPRS_RX_BUFF_LEN]={0};
//    U8  rxLen = GPRS_ATCmdCB.ucRxLen;
//    U8 *rxBuff = &g_stGPRS_Handler.RxBuf[Get_Comma(2,g_stGPRS_Handler.RxBuf)];
//    APP_GPRS_Data_Trope(rxBuff,rxLen,TropeBuf);
//    if(APP_GPRS_RxDataCheck(TropeBuf) == FALSE)  return;   //±ê¼Ç´íÎóÂë£¬´ýÌí¼Ó
//    APP_GPRS_RxDataDecode(TropeBuf);
//}


